[["Abington","Town Hall, 500 Gliniewicz Way","The dropbox is a payment box beside the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Acton","Town Hall: 472 Main St.","Dropbox is located to the right hand side of the main entry doors of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01720"],["Acushnet","Parting Ways building, 130 Main St","The dropbox is located outside of the Parting Ways building near Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Adams","Town Hall, 8 Park Street","Dropbox is located in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01220"],["Agawam","Town Hall, 36 Main Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Alford","Town Hall: 5 Alford Center Road","There is a dropbox located at the Town Offices. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Amesbury","City Hall, 62 Friend Street","The dropbox is beside the front entrance of city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01913"],["Amherst","Town Hall, 4 Boltwood Ave","Dropbox is located around the corner of Town Hall on Main Street You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01002"],["Andover","Town Hall, 36 Bartlet Street","There are two dropboxes at the Town Offices: one is located in front of town hall at the Bartlet Street entrance and the other is inside of the Town Offices at the Customer Service Center. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01810"],["Aquinnah","Town Hall: 955 State Road","Dropbox is located to the left of the main entrance to the town offices on the outside of the building You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02535"],["Arlington","• East Arlington - Outside the Fox Branch Library (175 Massachusetts Ave)\n• Arlington Center - In front of Town Hall (on the lower plaza) \n• Arlington Heights - Outside ACMI Studios (85 Park Avenue)","There are three dropboxes located outside the Fox Branch Library, in front of Town Hall, and outside ACMI studios. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Ashburnham","Town Hall: 32 Main Street","The dropbox is located to the right of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Ashby","Town Hall, 895 Main Street ","Dropbox is located next to town hall across from the mailboxes at the west entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01431"],["Ashfield","Town Hall: 412 Main Street","The dropbox is located outside of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Ashland","Town Hall: 1010 Main Street","You can drop your ballots in the payment dropbox outside of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Athol","Town Hall, 584 Main Street ","You can drop your ballot in the dropbox at Town Hall, located by front entrance stairs on the right You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Attleboro","City Hall, 77 Park Street","The dropbox is beside the Pine Street entrance of city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02703"],["Auburn","104 Central St.","The dropbox is located outside the front of Auburn Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Avon","65 East Main Street ","There is a dropbox located at the Municipal Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Ayer","Town Hall: 1 Main Street","There are two dropboxes located outside both entrances of the town hall; on Main Street and Columbia Street. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Barnstable","Town Hall, 367 Main Street ","Drop the ballot off into the black secure lock box located near the entrance of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02601"],["Barre","Henry Woods Building, 40 West St.","The dropbox is located to the right of the stairs at the front entrance of the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Becket","Town Hall, 557 Main Street","Dropbox is located on the Town Hall front porch. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01223"],["Bedford","Town Hall, 10 Mudge Way","The dropbox is located outside of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Belchertown","Town Hall: 2 Jabish St","Dropbox is located next to ramp entrance near the elevators You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01007"],["Bellingham","Municipal Center: 10 mechanic st.","Thre are two dropboxes; one at the front entrance of the municipal center, the other in a \"drive-up, drop-off\" area inside th parking lot.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02019"],["Belmont","Town Hall, 455 Concord Avenue","Secure, marked dropbox is located on the driveway side of Town Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02478"],["Berkley","1 North Main Street","The dropbox is located outside of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Berlin","The Town Offices, 23 Linden St.","You can drop your ballot in the secure green dropbox in the entrance lobby of the Town Offices. Open the door and walk straight ahead three steps.\n You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Bernardston","Town Hall: 38 Church St.","There is no dropbox in Bernardston, but you can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Beverly","City Hall, 191 Cabot St. • Central Fire Station, 15 Hale St • Beverly Farms Fire Station, 2 West St","There are 4 dropboxes: one inside the City Hall back entrance, one outside the City Hall back entrance, one at the Central fire station, and one at the Beverly Farms fire station. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Billerica","Town Hall: 365 Boston Road","Drop ballots in the green box by the accesible entrance on right hand side of building You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01821"],["Blackstone","Town Hall, 15 St. Paul Street","You can drop your ballot in the dropbox located at the front entrance of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01504"],["Blandford","Town Hall: 1 Russell Stage Rd","There is a dropbox for you to drop your ballots in directly in front of the town hall on right hand side of doors. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Bolton","Town Hall, 663 Main Street ","Drop ballots up the hill near the walkway to the main entrance of Town Hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01740"],["Boston","• 1 City Hall Square (City Hall Plaza — Main Entrance and Congress St. Entrance)\n• 365 Bremen Street, East Boston (East Boston Branch Library)\n• 179 Main Street, Charlestown (Charlestown Branch Library)\n• 646 East Broadway, South Boston (South Boston Branch Library)\n• 700 Boylston Street, Back Bay (Boston Public Library — Central Branch)\n• 149 Dudley Street, Roxbury (Roxbury Branch Library)\n• 300 North Harvard Street, Allston (Honan-Allston Branch Library)\n• 40 Academy Hill Road, Brighton (Brighton Branch Library)\n• 1520 Dorchester Avenue, Dorchester (Fields Corner Branch Library)\n• 30 South Street, Jamaica Plain (Jamaica Plain Branch Library)\n• 1350 Blue Hill Avenue, Mattapan (Mattapan Branch Library)\n• 1961 Centre Street, West Roxbury (West Roxbury Branch Library)\n• 35 Harvard Avenue, Hyde Park (Hyde Park Branch Library)\n• 1497 Tremont Street, Roxbury (Parker Hill Branch Library)\n• 41 Geneva Avenue, Dorchester (Grove Hall Library)\n• 125 Brookway Road, Roslindale (BCYF Menino)","Starting October 17, there will be dropboxes located at the Honan-Allston Library, Brighton Library, Charlestown Library, Fields Corner Library, Grove Hall Library, Boston City Hall, East Boston Library, Hyde Park Library, Jamaica Plain Library, Mattapan Library, BCYF Menino, Roxbury Library, Parker Hill Library, South Boston Library, and West Roxbury Library. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Bourne","24 Perry Avenue","One dropbox is outside and behind the town hall, the other is in front of the community center on the days of early voting. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Boxborough","Town Hall: 29 Middle Road","There is no dropbox; you must sumbit your ballot to the mail slot to the left of the main entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Boxford","Town Hall, 7A Spofford Rd","Dropbox is located opposite the mail slot in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01921"],["Boylston","Town Hall, 221 Main Street","The dropbox is to the right of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Braintree","Town Hall: 1 John F Kennedy Memorial Dr.","The dropbox is located outside of the parking lot of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Brewster","Town Hall, 2198 Main St","You can drop your ballot in the dropbox located to the right of the front entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02631"],["Bridgewater","Academy Building: 66 Central Square ","The dropbox is beside the side entrance nearest the accessibility ramp at the Bedford Street parking lot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Brimfield","Please contact your town clerk at the contact information below to find out where to drop your ballot.","townclerk@brimfieldma.org 413-245-4100 x 7 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Brockton","City Hall, 45 School St","The dropbox is outside of City Hall by the handicap entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02301"],["Brookfield","Town Hall: 6 Central Street","The dropbox is located outside and beside the front entrance of the town offices. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Brookline","333 Washington Street","The dropbox is by the front door of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02445"],["Buckland","Town Hall: 17 State St, Shelburne Falls","You can pace your ballot in the dropbox, located outside to the left of the front entrance of Town Hall and is in the form of a black lock box. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Burlington","Town Hall, 29 Center Street","There are several dropboxes located at the front steps, the left side door, and the right side door of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Cambridge","• City Hall - Near the back door of the building located at 795 Massachusetts Avenue\n• Morse School - Near the front entrance of the building located at 40 Granite Street\n• Cambridge Police Headquarters - Left-side of the front of the building located at 125 6th Street\n• Maria L. Baldwin School - Right-side of the Oxford Street entrance of the building located at 28 Sacramento Street\n• O’Neill Library - Adjacent to the entrance stairs of the building located at 70 Rindge Avenue\n• Coffon Building - Right-side of the front of the building located at 51 Inman Street","There are six dropbox locations: City Hall - Near the back door of the building located at 795 Massachusetts Avenue; Morse School - Near the front entrance of the building located at 40 Granite Street; Cambridge Police Headquarters - Left-side of the front of the building located at 125 6th Street; Maria L. Baldwin School - Right-side of the Oxford Street entrance of the building located at 28 Sacramento Street; O’Neill Library - Adjacent to the entrance stairs of the building located at 70 Rindge Avenue; Coffon Building - Right-side of the front of the building located at 51 Inman Street You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02139"],["Canton","Town Hall, 801 Washington Street ","Drop ballots in the payment box of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02021"],["Carlisle","Town Hall: 66 Westford Street ","Dropbox is located to the left of the front main doors You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01741"],["Carver","Town Hall, 108 Main Street ","You can drop your ballot in the grey colored drop box shared with the tax collector, which also serves a ballot dropbox. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02330"],["Charlemont","Please contact your town clerk at the contact information below to find out where to drop your ballot.","kathy.reynolds@townofcharlemont.org 413-339-4335 x 305 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Charlton","Town Hall, 37 Main Street","Dropbox is located outside town hall near accessible parking You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01507"],["Chatham","Town Hall, 549 Main Street","Place in secure dropbox outside main entrance of the Chatham Town Offices.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02633"],["Chelmsford","Town Hall, 50 Billerica Road","Dropboxes are located in front of the town hall as well as outside of the Town Clerk's office in the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01824"],["Chelsea","City Hall: 500 Broadway","The dropbox is located beside the side entrance of the city hall, on Washington Avenue. It is a green mailbox with bold orange signage. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Cheshire","Town Hall, 80 Church St","There is a dropbox located at the Town Hall entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Chester","Town Hall: 15 Middlefield Road","The dropbox is located and outside and beside the front entrance of the town hall. It is labelled “Town Of Chester.” You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Chesterfield","Town Hall: 422 Main Road","You can drop your ballots at town hall, in the dropbox located on the right side of the door at the main entrance (driveway), right next to the ramp. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Chicopee","Town Hall: 274 Front St","The dropbox is located outside of the town hall and to the right of the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Chilmark","Town Hall, 401 Middle Road","Two ballot dropboxes are located at the main entry to the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Clarksburg","Town Hall, 111 River Road","The dropbox is the tax collector's dropbox inside the Town Hall entryway. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Clinton","Town Hall: 242 Church St","The dropbox is located outside and beside the front stairs of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Cohasset","Town Hall, 41 Highland Ave","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02025"],["Colrain","Town Offices: 55 Main Rd ","Insert ballots into the labeled slot in the foyer of the town offices. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Concord","Town House, 22 Monument Square","The dropbox is located next to the entrance on the left side of the town house You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01742"],["Conway","Please contact your town clerk at the contact information below to find out where to drop your ballot.","clerk@townofconway.com 413-369-4235 x 4 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Cummington","Town Hall, 33 Main St","Dropbox located at the side entrance of the Town Hall parking lot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Dalton","Town Hall: 462 Main Street","There are two dropboxes; one is nearest to the accessibility ramp, the other is outside by the front door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Danvers","Town Hall, 1 Sylvan Street","You can drop your ballot in the dropbox at Town Hall, located bottom of front steps You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01923"],["Dartmouth","Town Hall: 400 Slocum Rd","There are 2 dropboxes beside the front entrance of the town hall. It has yellow signage. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Dedham","Town Hall, 450 Washington St","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02026"],["Deerfield","Town Hall: 8 Conway St","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Dennis","Town Hall, 685 MA-134, South Dennis ","There is one dropbox located at the front entrance at the bottom of the steps of Town Hall and another one inside the vestibule on the right side entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02660"],["Dighton","Town Hall: 979 Somerset Avenue","The dropbox is located outside and near the driveway of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Douglas","Town Hall, 29 Depot Street","Dropbox is located at front of building at beginning of the accessibility ramp.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01516"],["Dover","Town Hall, 5 Springdale Avenue","Drop ballots in the Treasurer's payment box in the semi circle drive. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02030"],["Dracut","Town Hall, 62 Arlington Street","Dropbox is located in front of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01826"],["Dudley","Town Hall, 71 West Main Street","Dropbox is located in the Police Department Lobby. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01571"],["Dunstable","Please contact your town clerk at the contact information below to find out where to drop your ballot.","CSkerrett@dunstable-ma.gov 978-649-4514 x 222 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Duxbury","Town Hall, 878 Tremont St","Dropbox is located outside the back door of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02332"],["East bridgewater","Town Hall: 175 Central St.","The dropbox is to the left of the front entrance of the town hall. It is silver and has  “Tax Collector” and “Ballot Return” labelled on it. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["East brookfield","Town Hall, 122 Connie Mack Drive","You can drop your ballots in the dropbox at the back entrance of the Town Office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01515"],["East longmeadow","Town Hall, 60 Center Square","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01028"],["Eastham","Town Hall, 2500 State Highway","The dropbox is located outside of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02642"],["Easthampton","Municipal Building, 50 Payson Avenue","The dropbox is located at the Municipal Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01027"],["Easton","136 Elm Street","You can drop your ballots in the dropbox located by the front door of the Town Offices You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Edgartown","Town Hall, 70 Main Street ","Two dropboxes located in the inside lobby of Town Hall as well as the outside. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02539"],["Egremont","Town Hall, 171 Egremont Plain Road","You can drop your ballot in the dropboxes located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01230"],["Erving","Town Hall, 12 East Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01344"],["Essex","Town Hall, 30 Martin Street ","Dropbox is located outside of front door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01929"],["Everett","City Hall: 484 Broadway\n","Dropboxes are located at every door of town hall: at the front Broadway door, side parking lot entrance, and the Church St entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Fairhaven","Town Hall: 40 Center Street","There is no dropbox; you must deliver your ballot at the mail slot in the front entrance of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Fall river","1 Government Center","The dropbox is located at the 3rd Street entrance of government center. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Falmouth","Town Hall, 59 Town Hall Square","Dropbox is a grey mail box on the left of the walk way to the front middle entrance to Town Hall  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02540"],["Fitchburg","City Hall, 166 Boulder Drive","Red Mail-Drop Box in front of City Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01420"],["Florida","Please contact your town clerk at the contact information below to find out where to drop your ballot.","floridaclerk.floridamass@gmail.com 413-662-2448 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Foxborough","Town Hall: 40 South Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Framingham","• Memorial Building, 150 Concord Street\n• McAuliffe Library, 746 Water St","One dropbox is located in the rear of the Memorial Building, beneath a banner that reads \"Drop Election Ballot Here\" in English, Spanish, and Portuguese. There is also one located at the McAuliffe Library. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Franklin","Town Hall: 355 East Central St.","The dropbox is located to the left of the front entrance of the town hall. It is white.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Freetown","Town Hall, 3 North Main Street, Assonet","The dropbox is located in front of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02702"],["Gardner","City Hall, 95 Pleasant Street ","The dropbox is located at the front of City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01440"],["Georgetown","Town Hall, 1 Library Street ","You can drop your ballot in the dropbox located at the back door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01833"],["Gill","Town Hall: 325 Main Rd ","Place your ballots in the dropbox located at the rear of the Town Hall, to the left of the entrance.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Gloucester","City Hall: 9 Dale Avenue","The dropbox is located on the side entrance of the city hall facing Warren Street.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Goshen","40 Main St, Goshen","The dropbox is located at the front of the Town Office's building, up the stairs and the box is to the left of the door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Gosnold","Town Clerk's office, 28 Tower Hill road, Cuttyhunk","You can drop your ballot in the dropbox located at town clerks office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02713"],["Grafton","Town Hall, 30 Providence Road ","Dropbox is located in front of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01519"],["Granby","Town Hall, 215 b west state street ","You can drop your ballot in the dropbox located at the Town Hall Annex. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01033"],["Granville","Please contact your town clerk at the contact information below to find out where to drop your ballot.","townclerk@townofgranville.org 413-357-8585 x 3 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Great barrington","Town Hall: 334 Main Street #1","The dropbox is located outside and beside the front stairs of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Greenfield","City Hall, 14 Court Square","The dropbox is beside an accessibility ramp on the right side of city hall and to the left of an entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01301"],["Groton","Town Hall, 173 Main Street ","You can drop your ballot in the dropbox located at the rear of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01450"],["Groveland","Town Hall: 183 main street","Dropbox is located inside of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01834"],["Hadley","Town Hall: 100 Middle Street","Dropbox is located at the side door of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01035"],["Halifax","Town Hall, 499 Plymouth Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02338"],["Hamilton","Town Hall, 577 Bay Rd, South Hamilton","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01982"],["Hampden","Town House, 625 Main Street","Dropbox is located behind the town house, to the left of the foyer You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01036"],["Hancock","Town Hall, 3650 Hancock Road","The dropbox islocated at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01237"],["Hanover","Town Hall, 550 Hanover Street ","Dropbox is located at front of Town Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02339"],["Hanson","Town Hall, 541 Liberty Street ","Dropbox is located at the flagpole by Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02341"],["Hardwick","Town Hall, 307 Main St. Gilbertville ","Dropbox is located at the top of the front stairs to the right You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01082"],["Harvard","Town Hall, 13 Ayer Road ","You can drop your ballot at the mail slot to the left of the front doors at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01451"],["Harwich","Town Hall, 732 Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02645"],["Hatfield","Town Hall, 59 Main Street","There is a dropbox on the south side of Town Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01038"],["Haverhill","• City Hall, 4 Summer Street (Back of Building)\n• Police Department, 40 Bailey Blvd. (Inside lobby)","There are two dropboxes: one located at the back of City Hall and inside the Police Station lobby. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Hawley","Town Hall, 8 Pudding Hollow Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01339"],["Heath","Town Hall: 1 East Main St.","You can drop your ballots off at the dropbox located inside Town Hall next to the Post Office door.\n\n You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Hingham","Town Hall, 210 Central Street","You can drop your ballot in the dropbox located in Town Hall driveway. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02043"],["Hinsdale","Town Hall, 39 South Street","The dropbox is located to the left of the side entrance of the town hall, nearest the upper parking lot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Holbrook","Town Hall: 50 North Franklin","The dropbox is located outside of the front entrance of the town hall, on the doorstep. It is blue and labelled \"Town Business.\" You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Holden","Town Hall: 1196 Main Street","Drop box is labeled \"Town Clerk business only\" located next to Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Holland","Town Hall, 27 Sturbridge Road","There is a dropbox located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01521"],["Holliston","Town Hall, 703 Washington Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01746"],["Holyoke","City Hall, 536 Dwight Street ","The dropbox is beside the back entrance of city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01040"],["Hopedale","Town Hall, 78 Hopedale Street","Drop ballots in the mail slot at the general office door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01747"],["Hopkinton","Town Hall, 18 Main Street","You can drop your ballots in the dropbox in the alcove next to front entry to town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01748"],["Hubbardston","Library Basement Offices: 7 Main Street","The dropbox is located outside of the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Hudson","Town Hall, 78 Main Street ","Official ballot dropbox on the Church St entrance of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01749"],["Hull","Town Hall: 253 Atlantic Ave.","Dropbox is located in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02045"],["Huntington","Town Hall, 24 Russell Road ","Dropbox is located by the side door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01050"],["Ipswich","Town Hall, 25 Green Street ","Dropbox is white marked \"Ballots and Treasurer Collector\" located in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01938"],["Kingston","Town Hall, 26 Evergreen Street"," The dropbox is located at Kingston Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02364"],["Lakeville","Town Hall, 346 Bedford Street","The dropbox is located at the front of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02347"],["Lancaster","Old Town Hall: 695 Main Street","The dropbox is located at the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01523"],["Lanesborough","Town Hall, 83 North Main St","The dropbox is located at Town Hall.You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01237"],["Lawrence","Please contact your town clerk at the contact information below to find out where to drop your ballot.","wmaloney@cityoflawrence.com 978-620-3290 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Lee","Town Hall, 32 Main Street ","Dropbox is located in the town hall entryway You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01238"],["Leicester","3 Washburn Square","The dropbox is located at the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Lenox","Town Hall: 6 Walker Street","The dropbox is located inside the lobby of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Leominster","City Hall, 25 West St.","The dropbox is located outside the front entrance of the city hall, near the top of the stairs. It is a grey and navy mailbox. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Leverett","Town Hall: 9 Montague Rd.","Dropbox is located at the back entrance of Town Hal. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01054"],["Lexington","Town Clerk Mailbox: 1625 MA ave.","You can drop your ballot in the dropbox, labeled depository- Town Clerk's office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02420"],["Leyden","Please contact your town clerk at the contact information below to find out where to drop your ballot.","townclerk@townofleyden.com 413-774-4111 x 3 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Lincoln","Town Clerks Office: 16 Lincoln Rd.","You can drop your ballot in the dropbox located at the front of the Town Clerks Office Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01773"],["Littleton","Town Hall: 37 Shattuck St.","Dropbox is located on the side of the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01460"],["Longmeadow","Town Hall: 20 Williams Street","The dropbox is a mail slot located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Lowell","City Hall: 375 Merrimack St.","There are two dropboxes located outside City Hall: one at the entrance to JFK Plaza, adjacent to the public notice board, and the other at the Merrimack St. Entrance to City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01852"],["Ludlow","Town Hall, 488 Chapin Street ","Dropbox is located behind town hall on the left side of the double doors You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01056"],["Lunenburg","17 Main Street","The dropbox is to the right of the main entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01462"],["Lynn","City Hall: 3 City Hall Square ","The dropbox is beside the accessibility entrance of city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01901"],["Lynnfield","Town Hall, 55 Summer Street"," You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01940"],["Malden","• City Hall, 215 Pleasant Street\n• Police Station, 800 Eastern Avenue\n• Senior Center Auditorium, 7 Washington Street","There are 3 dropboxes: one located at the front of City Hall, one at the Police Station, and one at the Senior Center Auditorium. They are open during early voting hours.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02148"],["Manchester-by-the-sea","Town Hall: 10 Central St","Dropbox is located behind town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01944"],["Mansfield","Town Hall, 6 Park Row","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02048"],["Marblehead","Town Hall, 188 Washington Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01945"],["Marion","Town House, 2 Spring Street","Dropbox is located in front of town house You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02738"],["Marlborough","City Hall, 140 Main Street ","There are dropboxes located at the front and back entrances to City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01752"],["Marshfield","870 Moraine Street","The dropbox is located at Town Hall through the town clerk's exterior window and is available 24 hours a day. The slot is 8 windows down the Snow Road side of the building and is clearly marked. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02050"],["Mashpee","Town Hall: 16 Great Neck Rd. N.","Dropbox is a mail slot located at the front of the building by the front door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02649"],["Mattapoisett","Town Hall: 16 Main St.","There are two dropboxes: one in the back corner of Town Hall and one located on the front lawn. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Maynard","Town Hall: 195 Main Street ","Dropbox is located right in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01754"],["Medfield","Town Hall: 459 Main Street","The dropbox is located behind the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Medford","City Hall, 85 George P. Hassett Drive","The dropbox is located at the left side of City Hall closest to 93. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02155"],["Medway","Town Hall, 155 Village Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02053"],["Melrose","Post Office: 23 Essex Street","The dropbox is located on the east side of the post office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Mendon","20 Main St.","Place ballots in the dropbox that is located to the right of the entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Merrimac","Town Hall: 2 School Street","You can drop your ballots off at Town Hall at the front door in the mail slot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Methuen","City Hall, 41 Pleasant Street ","The dropbox is outside City Hall, at the ground level entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01844"],["Middleborough","Town Hall: 10 Nickerson Ave; Town Clerk's Office: 20 Centre st, 1st Floor","There are 2 dropboxes: one at the Annex Building at the Town Clerk's Office and one at Town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02346"],["Middlefield","Town Hall: 188 Skyline Trail","Dropbox located left of the main entrance to Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01243"],["Middleton","Town Hall, 48 South Main Street","There is a dropbox located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01949"],["Milford","Town Hall: 52 Main Street","Two dropboxes are located on the North Bow St side of town hall on the second landing up the stairs as well as at the beginning of the ramp on the Court St side. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01757"],["Millbury","Town Hall: 127 Elm Street","Dropbox is located outside of town hall, to the left of the main doors. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01527"],["Millis","Town Hall: 900 Main St.","Dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02054"],["Millville","Town Hall, 290 Main Street","There is a dropbox located at the back of Town Hall to the right of the posting board. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Milton","Town Hall, 525 Canton Ave","Dropbox is located directly on the north side of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02186"],["Monroe","Please contact your town clerk at the contact information below to find out where to drop your ballot.","elections@sec.state.ma.us 413-424-5272 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Monson","Town Hall, 110 Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01057"],["Montague","Town Hall, 1 Avenue A, Turners Falls","You can drop your ballot in the dropbox near the front door of Town Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01376"],["Monterey","Town Hall: 435 Main Road","There is a dropbox located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Montgomery","161 Main Road ","The dropbox is by the front door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01085"],["Mount washington","Please contact your town clerk at the contact information below to find out where to drop your ballot.","gailg@townofmtwashington.com 413-528-9264 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Nahant","Town Hall, 334 Nahant Rd.","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01908"],["Nantucket","Town Hall, 16 Broad Street","You can drop your ballot in the dropbox located at the front entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02554"],["Natick","Town Hall, 13 East Central Street","You can drop your ballot into the Mail slot immediately to the right of the front door, which is serving as the ballot dropbox. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01760"],["Needham","Town Hall, 1471 Highland Avenue ","You can drop your ballot in the dropbox located in Town Hall driveway You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02492"],["New ashford","Please contact your town clerk at the contact information below to find out where to drop your ballot.","elections@sec.state.ma.us 413-458-5461 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["New bedford","City Hall, 133 William Street","The dropbox is located at the front steps of City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02740"],["New braintree","Town Hall, 20 Memorial Drive","You can drop your ballot in the dropbox located at the outside entrance of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01531"],["New marlborough","Town Hall: 807 Mill River Southfield Rd.","The dropbox is beside to the rear entrance of the town hall. It is blue. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["New salem","Town Hall, 15 South Main Street ","You can drop your ballot in the dropbox located at the front of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01355"],["Newbury","12 Kent Way, Byfield 01922","The dropbox is located at the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Newburyport","City Hall: 60 Pleasant St.","Secure mail slot is located to the left of the front door at City Hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Newton","City Hall, 1000 Commonwealth Avenue","The dropbox is outside the front of City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02459"],["Norfolk","Town Hall, 1 Liberty Lane","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02056"],["North adams","City Hall, 10 Main Street ","The dropbox is located outside of City Hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01247"],["North andover","Town Hall, 120 Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01845"],["North attleborough","Town Hall: 43 S Washington St.","The dropbox is outside and beside the back entrance of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["North brookfield","Town Hall: 215 North Main Street","Place your ballot in the dropbox right outside the town offices You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["North reading","Town Hall: 235 North Street","The dropbox is outside and beside the front entrance of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Northampton","City Hall, 210 Main Street","The dropbox is beside the side entrance of city hall, located on Crafts Avenue. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01060"],["Northborough","Town Hall, 63 Main Street","Drop ballots in the mail slot at the Town Offices.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01532"],["Northbridge","Town Hall, 7 Main Street, Whitinsville","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01588"],["Northfield","Town Hall/Police Station: 69 Main Street","Place your ballot in the dropbox at the back of the police station/city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Norton","Town Hall: 70 E Main Street","The dropbox is beside the front entrance of the town hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Norwell","Please contact your town clerk at the contact information below to find out where to drop your ballot.","There is a gray dropbox located at the front of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Norwood","Town Hall, 566 Washington St","There are two dropboxes: one by the main door of Town Hall and a drive up dropbox in the municipal parking lot behind Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Oak bluffs","Oak Bluffs Public Library, 56R School Street","The ballot dropbox is located at the entrance to the library. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Oakham","Town Hall, 2 Coldbrook Rd","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01068"],["Orange","Town Hall, 6 Prospect Street ","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01364"],["Orleans","Town Hall, 19 School Road","You can drop your ballot in the dropbox located next to the front entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02653"],["Otis","Town Hall, 1 North Main Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01253"],["Oxford","Please contact your town clerk at the contact information below to find out where to drop your ballot.","There are two dropboxes located at the front and back entrances of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Palmer","Town Hall, 4417 Main Street"," The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01069"],["Paxton","Town Hall, 697 Pleasant Street","Ther are two dropboxes at Town Hall: One next to the main entrance & one at the bottom of the side door entrance stairs. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01612"],["Peabody","City Hall, 24 Lowell Street","The dropbox is located at the accessibility entrance of the Chestnut Street side of City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01960"],["Pelham","Location 1:  Community Building Library Complex, 2 South Valley Road; Location 2: Offices/Rhodes Building, 51 Amherst Road ","There are two dropboxes: one at the Community Building Library Complex and one at the Town Offices. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01002"],["Pembroke","Town Hall, 100 Center St","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Pepperell","Town Hall, 1 Main Street ","You can drop your ballot in one of the two dropboxes located at town hall, either on the lower or upper level. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01463"],["Peru","Town Hall, 3 East Main Road","Dropbox is located at the community center. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01235"],["Petersham","3 South Main St.","The dropbox is located to the left of the door at the Town Office Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Phillipston","Town Hall: 50 The Common","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Pittsfield","70 Allen St","The dropbox is beside the front entrance of the city hall, leading up to staircase at door in lot in between city hall and Highland Restaurant. It is a large and black. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Plainfield","Town Offices, 304 Main St","Dropbox located at the front door of the Town Office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Plainville","Town Hall, 190 South Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02762"],["Plymouth","Town Hall, 26 Court St, Plymouth","Dropbox is located outside of town hall main entrance You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Plympton","5 Palmer Rd, Town Hall","The dropbox is located at the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Princeton","Post Office Place: 206 Worcester Road","You can drop your ballot in the dropbox at the back of building at the bottom of ramp, in front of glass doors at the Post Office Place. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Provincetown","260 Commercial Street","There is a dropbox attached to the wal to the left of the Ryder St entrance of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Quincy","1305 Hancock St, Quincy","The dropbox is located at the entrance to City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Randolph","41 South Main St","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Raynham","Town Hall, 558 South Main Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02767"],["Reading","Town Hall, 16 Lowell Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01867"],["Rehoboth","Town Hall, 148 Peck Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02769"],["Revere","281 Broadway, Revere","There is a dropbox located on the Pleasant Street side of basement entrance to City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Richmond","Town Hall, 1529 State Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01254"],["Rochester","Please contact your town clerk at the contact information below to find out where to drop your ballot.","pdawson@townofrochester.com 508-763-3871 x 17 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Rockland","Town Hall, 242 Union St #1, Rockland ","Drop ballots through the brass drop slot on the side of the building You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02370"],["Rockport","Town Hall, 34 Broadway","Dropbox is located by the accesibility entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01966"],["Rowe","Town Hall, 321 Zoar Rd","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01367"],["Rowley","139 Main Street","The dropbox is at the foot of the stairs on the side of the building facing the cemetery You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01969"],["Royalston","Royalston does not have a drop box. Ballots should be mailed. The Town Clerk will be available to take ballots on election day personally at the Town Clerk office in Whitney Hall, 5 School Street.","townclerk@royalston-ma.gov You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Russell","Please contact your town clerk at the contact information below to find out where to drop your ballot.","russelltownclerk@russellma.net 413-862-6207 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Rutland","Community Hall, 250 Main Street","The dropbox beside the accessibility entrance of community hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01543"],["Salem","• City Hall – 93 Washington St.\n• Fire Station Headquarters – 48 Lafayette St.\n• Fire Station #5 – 64 Loring Ave. \n• Fire Station #4 – 415 Essex Street\n• Fire Station #2 – 142 North St.","There are 5 dropbox locations: Central Headquarters Fire Station, Fire Station #5, Fire Station #4, Fire Station #2, as well as at City Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Salisbury","Town Hall, 5 Beach Road","Dropbox is located in the corner between the stairs and the accessibility ramp at the side entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01952"],["Sandisfield","Please contact your town clerk at the contact information below to find out where to drop your ballot.","townclerk@sandisfieldma.gov 413-258-4711 x 2 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Sandwich","145 Main Street","The dropbox is by the sidewalk just outside of building's main entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02563"],["Saugus","Town Hall, 298 Central Street ","There is a dropbox located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01906"],["Savoy","Please contact your town clerk at the contact information below to find out where to drop your ballot.","savoytownclerk@gmail.com 413-743-3759 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Scituate","Town Hall, 600 Chief Justice Cushing Hwy","Drop ballots in the mail slot or dropbox at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02066"],["Seekonk","Town Hall, 100 Peck St.","You can drop your ballot in the dropbox in front of Seekonk Town Hall  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02771"],["Sharon","Town Hall: 90 South Main Street","The dropbox is in the entry way of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Sheffield","Town Hall, 21 Depot Square","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01257"],["Shelburne","Town Hall: 51 Bridge Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Sherborn","Town Hall, 19 Washington Street ","You can drop your ballot in the dropbox located at the front of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01770"],["Shirley","Town Hall, 7 Keady Way ","Dropbox is located on the wall to the left of the front door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01464"],["Shrewsbury","Town Hall, 100 Maple Avenue","You can drop your ballot in the grey Town Bills box, which also serves as a ballot dropbox, in front of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01545"],["Shutesbury","Town Hall, 1 Cooleyville Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01072"],["Somerset","140 Wood Street","The dropbox is located at the parking lot of the town office, nearest of the elevator lobby. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02726"],["Somerville","• Front of City Hall, at the top of the concourse, 93 Highland. Ave\n• At the Glen Street entrance to the East Somerville Community School, 50 Cross St.\n• At the entrance to the Argenziano School, 290 Washington Street\n• At the entrance to the Winter Hill Community School, 115 Sycamore Street\n• In front of St Catherine’s parking lot near the corner of Spring Street, near 182 Summer St.\n• Near 269 Highland Avenue, next to Fire Engine 7\n• Near 351 Summer Street in front of the Dilboy Post\n• In front of the Somerville Community Baptist Church, 31 College Avenue\n• In front of the Tufts Administrative Building 167 Holland Street\n• In front of the West Somerville Neighborhood School, 177 Powder House Blvd.","There are 10 total dropboxes located at: the front of City Hall (top of the concourse), entrance to the Argenziano School, outside West Somerville Neighborhood School, entrance to Winter Hill Community School, front of Tufts Administrative Building, front of Somerville Community Baptist Church, near Fire Engine 7, Glen Street entrance to East Somerville Community School, front of the Dilboy Post, and front of St. Catherine of Genoa Parish parking lot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02143"],["South hadley","116 Main Street","The dropbox is located right outside of the town office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01075"],["Southampton","210 College Hwy","The dropbox is located at the parking lot behind city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01073"],["Southborough","Town House, 17 Common Street","You can drop your ballot in the dropbox located at town house. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01772"],["Southbridge","Town Hall, 41 Elm Street","Drop ballots in the  “payment box” on the side of the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01550"],["Southwick","Town Hall, 454 College Highway","You can drop your ballots in the Green dropbox that you will see right when you pull into the entrance/exit of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Spencer","Town Hall, 157 Main St","You can drop your ballot at the dropboxes located at east and west side door entrances to town hall. The dropboxes are marked “payments/ballots” You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01562"],["Springfield","City Hall, 36 Court Street","The dropbox is located at the rear of City Hall and is gray. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01103"],["Sterling","Town Hall, 1 Park Street","You can drop your ballot in the dropbox located in the front of the municipal buidling. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01564"],["Stockbridge","Town Hall, 50 Main Street ","There are four dropboxes located at the Town Offices. They are located outside the front door, inside the downstairs lobby, outside the Police lobby and outside the back door, lower level entrance.You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01262"],["Stoneham","Town Hall, 35 Central Street","The dropbox is located at the back of town hall on the Emerson Street side. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02180"],["Stoughton","Town Hall, 10 Pearl St.","You can drop your ballot in the dropbox located inside the entrance to Town Hall.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02072"],["Stow","380 Great Road","You can drop your ballot in the dropbox located in front of the Town Building (the main office building), or in the mail slot of the front door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Sturbridge","Town Hall, 308 Main St.","Secure dropbox is located outside to the right of the town hall back entrance You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01566"],["Sudbury","Location 1: Town Hall, 322 Concord Road; Location 2: Goodnow Library, 21 Concord Road (Library Book Drop) "," One dropbox is located at Town Hall inside the rear vestibule and it is open 24/7. The other one is located at Goodnow Library as a drive-thru ballot drop off. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01776"],["Sunderland","12 School Street","The dropbox is located at the rear of the town office. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01375"],["Sutton","Town Hall, 4 Uxbridge Rd","Drop box is located on the sidewalk in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01590"],["Swampscott","Town Hall, 22 Monument Ave","You can drop your ballot in the dropbox located at the front entrance of town hall.   You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01907"],["Swansea","Town Hall, 81 Main Street","The dropbox is located at the Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02777"],["Taunton","• Renovated City Hall, 15 Summer St\n• Temporary City Hall, 141 Oak St","There are two dropboxes: a red, white, and blue dropbox is located at the newly renovated City Hall at 15 Summer St; and a gray dropbox is located in front of the temporary City Hall at 141 Oak St. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Templeton","Town Hall, 160 Patriots Rd","You can drop your ballots in the blue dropbox located at beginning of walkway to Town Hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01438"],["Tewksbury","Town Hall, 1009 Main St","You can drop your ballot in the dropbox located outside of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01876"],["Tisbury","Town Hall, 51 Spring St.","There is no dropbox but you can deliver your ballot to the service window at the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02568"],["Tolland","241 W. Granville Rd.","There is no dropbox; you must drop your ballot in the slot at the front entrance, facing Route 57.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01034"],["Topsfield","Town Hall, 8 West Common Street ","Dropbox is located in front of the street-side entrance of Town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01983"],["Townsend","Town Hall, 272 Main Street ","Dropbox is located next to the main entrance of the parking lot. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01469"],["Truro","24 Town Hall Rd","The dropbox is outside and to the left of the front entrance of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Tyngsborough","25 Bryant Ln","The dropbox is located outside the Town Hall on the left side. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Tyringham","Town Hall, 116 Main Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01264"],["Upton","Town Hall, 1 Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01568"],["Uxbridge","Town Hall, 21 South Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01569"],["Wakefield","Town Hall, 1 Lafayette Street","You can drop your ballot in the dropbox located on the steps of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01880"],["Wales","3 Hollow Rd","The dropbox is located at the Town Office Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Walpole","Town Hall: 135 School St.","You can drop your ballots in the drop box near the back door of town hall, attached to the building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Waltham","City Hall, 610 Main Street","The dropbox is beside the back entrance of city hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02452"],["Ware","126 Main St.","The dropbox is located at the lower level offices of the town hall. Voters should bring their ballots during daytime hours, Monday through Friday, rather than leave them overnight or on the weekend. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01082"],["Wareham","Town Hall, 54 Marion Rd","Dropbox is located right next to the collector's dropbox on the left side of the driveway. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02571"],["Warren","Town Hall, 48 High Street","The dropbox is located at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01083"],["Warwick","Town Hall, 12 Athol Road","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01378"],["Washington","Town Hall, 8 Summit Hill Road","You can drop your ballot in the dropbox located in front of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01223"],["Watertown","Town Hall, 149 Main Street","You can drop your ballot in the dropbox located at the rear end of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02472"],["Wayland","• Public Safety Building, 38 Cochituate Road\n• Vestibule of Town Hall Main Lobby","You can place your ballots in the lockbox outside of the main entrance of the Public Safety Building or by the vestibule of the Town Hall main lobby. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01778"],["Webster","350 Main St","The dropbox is beside the parking lot ramp of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Wellesley","Town Hall, 525 Washington Street","Elections & Payment Drop Box outside of Town Hall entrance You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02482"],["Wellfleet","Town Hall, 300 Main St.","The dropbox is a gray box at the back door of town hall near the stairs. It is a universal drop box shared with the tax collector, but there is a large sign above it that says “place ballots in the gray dropbox.\" You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02667"],["Wendell","Town Offices, 9 Morse Village Road","The drop off box is located outside the Town Offices You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Wenham","138 Main Street","The dropbox is to the right of the main entrance of the town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01984"],["West boylston","Town Hall, 140 Worcester Street","You can drop your ballot in the dropbox that is currently located on the porch adjacent to Door 2 of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01583"],["West bridgewater","Town Hall, 65 North Main Street","You can drop your ballot in the dropbox located at town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02379"],["West brookfield","Town Hall, 2 East Main Street ","You can drop your ballot in the dropbox located at the Cottage St. entrance of town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01585"],["West newbury","Town Office Building, 381 Main Street ","You can drop your ballots in the dropbox (Labeled “Election Materials Deposited Here”) in the vestibule of the main entrance to the Town Office Building. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["West springfield","Town Hall, 26 Central Street","There are two dropboxes: one outside town hall and one in the main lobby. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01089"],["West stockbridge","Town Hall, 21 State Line Road ","You can drop your ballots off at either of the dropboxes located at Town Hall. Drop box 1 is located to the left of the entrance to Town Hall. There is also a drop box to the left of the Town Clerk's office window inside Town Hall - the building is open to the public at this time. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01266"],["West tisbury","Town Hall,1059 State Road ","There are two dropboxes: one outside town hall and one in the town hall lobby You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02575"],["Westborough","Town Hall, 34 West Main Street","Dropbox is located in front of town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01581"],["Westfield","City Hall, 59 Court Street","The dropbox is located by the sidewalk in the parking lot, nearest to the accessibility ramp. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01085"],["Westford","Town Hall, 55 Main Street","Dropbox is located at the back entrance to town hall, which is on the sidewalk between the town hall and the police station\n\n  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01886"],["Westhampton"," Please contact your town clerk at the contact information below to find out where to drop your ballot.","clerk@westhamptonma.org 413-203-3080 You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Westminster","Town Hall, 11 South St","There is a dropbox located at the front entrance of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Weston","Town Hall, 11 Town House Road","You can drop your ballot at the dropbox near the double glass doors at Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02493"],["Westport","Town Hall, 816 Main Road","Drop ballots in the red dropbox in front of the main town hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02790"],["Westwood","Police Station, 588 High Street","You can place your ballots in the dropbox, located in front of the police station. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02090"],["Weymouth","Town Hall, 75 Middle St","The dropbox is located at the back of Town Hall near the accessibility entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02189"],["Whately","Town Hall, 4 Sandy Lane","The dropbox is located at the Town Offices. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01373"],["Whitman","54 South Ave","The dropbox is located near the accessibility entrance. It is 4 feet tall and hard to miss.\n\n You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Wilbraham","Town Hall, 240 Springfield Street","The dropbox is located outside the back door of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01095"],["Williamsburg","Town Office, 141 Main Street, Haydenville","Dropbox is located by the main entrance to the town office, which is located in the back where the parking lot is You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01039"],["Williamstown","31 North St","The dropbox is located in front of Town Hall. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.",""],["Wilmington","Town Hall, 121 Glen Road","You can drop your ballots in the dropbox slot at Town Hall, adjacent to the front door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01887"],["Winchendon","Town Hall, 109 Front Street","You can drop your ballot at one of the dropboxes located at Town hall, at the side and front entrances. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01475"],["Winchester","Town Hall, 71 Mount Vernon Street ","There are two dropboxes: one near the front door and one near the back door You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01890"],["Windsor","Town Hall, 1890 Route 9 ","You can drop your ballot in the 2nd dropbox located inside town hall You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01270"],["Winthrop","Town Hall, One Metcalf Square ","There are two dropboxes: one by the front door and one in the Hermon Street parking lot You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02093"],["Woburn","City Hall, 10 Common St","The dropbox is toward the rear of City Hall, to the right of the door which is marked with signs.  You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01801"],["Worcester","• 455 Main Street (City Hall garage entrance)\n• 455 Main Street (City Hall - 1st Floor Back of the Common entrance)\n• 19 Burncoat Street (Burncoat Street Fire Station)\n• 266 Franklin Street (Franklin Street Fire Station)\n• 438 West Boylston Street (Greendale Fire Station)\n• 141 Grove Street (Grove Street Fire Station Headquarters)\n• 80 McKeon Road (McKeon Road Fire Station)\n• 424 Park Avenue (Park Avenue Fire Station)\n• 180 Southbridge Street (South Division Fire Station)\n• 745 Grafton Street (Southeast Fire Station)\n• 1067 Pleasant Street (Tatnuck Square Fire Station)\n• 40 Webster Street (Webster Square Fire Station)","There are 12 dropboxes located across the city at City Hall and fire stations. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01608"],["Worthington","Town Hall, 160 Huntington Rd","You can drop your ballots in the beige dropbox located outside the Town Hall ramp door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","01098"],["Wrentham","Town Hall, 79 South Street, Wrentham, MA","Dropbox is located outside town hall, on right side of main entrance. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02093"],["Yarmouth","1146 Route 28","The dropbox is located at the side entrance of the building. Do not put ballots in the USPS mail box at the front door. You can also drop your ballot off at your local election office, which you can find here: http://edmarkey.us/electionoffice.","02644"]]